experiments/03_triphasic_heartbeat/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment  Triphasic Pulsatile Heartbeat in a 1 mm Diameter Artery03 
//
// Inlet:  parabolic profile scaled by Q(t)codedFixedValue 
// 
// and the velocity profile is parabolic at every instant (quasi-Poiseuille).// Since the Womersley number 
// The full Womersley solution collapses to:
//
 ())r/)r
//
// Q(t) is the Mikheev SFA triphasic waveform scaled to 1 mm artery via
//// Murray's cube law (
// Waveform source: Mikheev et al. (2020), J. Physics: Conference Series,
//   vol. 1683, p. 022090. Physical simulation of femoropopliteal artery graft.

 diastolic decay.
//
// IMPORTANT: Q_norm can be NEGATIVE during flow reversal (early diastole,
// ~t=0.0.39 s). The negative parabolic velocity u < 0 at the inlet24
// is physically  it means the inlet is temporarily an outflow facecorrect 
// during the reversal phase. Do NOT clamp u  0 for this waveform.to 
//
// The 50-point table below was generated by assets/scripts/generate_qt_waveforms.py.
// Q_norm = Q(t)/Q_mean; use Q_norm  Q_mean to get Q(t).
//
// Outlet: zeroGradient (allows reversed flow without blocking).

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            triphasicParabolicInlet;

        code
        #{
 Physical constants             // 
            const scalar T_     = 0.857;     // cardiac period [s] (70 bpm)
            const scalar R0_    = 0.0005;    // vessel radius [m]
            const scalar A_     = M_PI * R0_ * R0_;  // cross-section area []]m
            // Q_mean_1mm = 2.07e-6             // Mean (0.5/2.   = 1.656e-8 ///sm5) volumetric flow [///s]: Mikheev SFA scaled to 1 mm via Murray m
            const scalar Q_mean = 1.656e-8;

            // Mikheev SFA triphasic  Q_norm = Q(t)/Q_meanwaveform 
            // Digitized from Mikheev et al. (2020) Fig. 1.
            // T = 0.857 s (70 bpm). TRIPHASIC: includes flow reversal.
            // 50 uniform points over [0, T]. Generated by generate_qt_waveforms.py.
            const int N_t = 50;
            const scalar t_table[50] = {
                0.0000, 0.0175, 0.0349, 0.0524, 0.0698,
                0.0873, 0.1047, 0.1222, 0.1396, 0.1571,
                0.1745, 0.1920, 0.2094, 0.2269, 0.2443,
                0.2618, 0.2793, 0.2967, 0.3142, 0.3316,
                0.3491, 0.3665, 0.3840, 0.4014, 0.4189,
                0.4363, 0.4538, 0.4712, 0.4887, 0.5061,
                0.5236, 0.5411, 0.5585, 0.5760, 0.5934,
                0.6109, 0.6283, 0.6458, 0.6632, 0.6807,
                0.6981, 0.7156, 0.7330, 0.7505, 0.7679,
                0.7854, 0.8029, 0.8203, 0.8378, 0.8570
            };
            // Q_norm values: NEGATIVE during flow reversal phase (~t=0.0.39 s)24
            const scalar Q_table[50] = {
                 0.1500,  0.1850,  0.3500,  0.8500,  2.5000,
                 5.5000,  8.5000, 11.0000, 12.0000, 11.0000,
                 8.5000,  5.5000,  2.8000,  0.8000, -0.8000,
                -2.0000, -2.8000, -3.2000, -2.8000, -2.0000,
                -1.0000, -0.2000,  0.4000,  1.0000,  1.4000,
                 1.6000,  1.5000,  1.3000,  1.1000,  0.9000,
                 0.7500,  0.6500,  0.5500,  0.4800,  0.4200,
                 0.3700,  0.3200,  0.2700,  0.2300,  0.2000,
                 0.1800,  0.1700,  0.1600,  0.1550,  0.1520,
                 0.1510,  0.1505,  0.1502,  0.1500,  0.1500
            };

            // Get current simulation time, wrap to [0, T_)
            const scalar t_    = this->db().time().timeOutputValue();
            const scalar t_mod = fmod(t_, T_);

            // Linear interpolation in the waveform table
            scalar Q_norm = Q_table[0];
            for (int i = 0; i < N_t - 1; i++)
            {
                if (t_mod >= t_table[i] && t_mod < t_table[i+1])
                {
                    scalar frac = (t_mod - t_table[i])
                                / (t_table[i+1] - t_table[i]);
                    Q_norm = Q_table[i] + frac * (Q_table[i+1] - Q_table[i]);
                    break;
                }
            }

            const scalar Q_t      = Q_mean * Q_norm;
            const scalar U_mean_t = Q_t / A_;

            // Set parabolic velocity profile on each inlet face.
            // NOTE: u can be NEGATIVE during flow  do NOT clamp.reversal 
            const vectorField& Cf = patch().Cf();
            forAll(Cf, faceI)
            {
                const scalar y = Cf[faceI].y();
                const scalar z = Cf[faceI].z();
                const scalar r = Foam::sqrt(y*y + z*z);
                const scalar u = 2.0 * U_mean_t * (1.0 - (r*r)/(R0_*R0_));
                operator[](faceI) = vector(u, 0.0, 0.0);
            }
        #};
    }

    outlet
    {
        // zeroGradient: allows reversed flow to exit freely during
        // the reversal phase of the triphasic waveform.
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
