experiments/03_triphasic_heartbeat/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// pimpleFoam uses KINEMATIC pressure: p_kin = p_physical / rho  [//]]sm
//
// Velocity-driven setup: pressure is NOT prescribed at the inlet.
// The outlet is held at gauge zero; the solver computes the time-varying
// pressure drop required to sustain the pulsatile velocity.
//
// During the flow reversal phase of the triphasic waveform, the inlet
// acts as an outflow (u < 0) and the outlet as inflow. Both patches use
// zeroGradient to avoid blocking the physically correct reversed flow.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
