experiments/03_triphasic_heartbeat/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Blood rheology — Newtonian approximation for large vessels (Re << 2300)
//
//   Dynamic viscosity : mu  = 0.0035  Pa·s          (at 37°C)
//   Density           : rho = 1060    kg/m³
//   Kinematic viscosity: nu = mu/rho = 3.302e-6 m²/s ≈ 3.3e-6 m²/s
//
// Note: icoFoam requires kinematic viscosity (nu), not dynamic viscosity.
// The Newtonian model is valid when shear rate > 100 s⁻¹ (large arteries).
// For low-shear recirculation zones, consider a Carreau model comparison.

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 3.3e-06;

// ************************************************************************* //
